Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: In general, WAV files are used for any short sound effects as even though they are generally larger files they will play instantaneously due to the fact that they do not need any type of decoding for playing.
zh_cn: 通常来说，WAV 格式的文件适合存放短音效，因为WAV格式文件较大，但是WAV格式不需要解码就可以直接播放。

source: In general, or an object to draw anything and register collisions with instances of other objects it needs to have a sprite which is added using the button.
zh_cn: 一般来说，除非这个物体用来绘制一些事物，或者与其他物体的实例产生碰撞，否则它需要有一个精灵，可以使用按钮 添加。

source: In general, shortcuts fall into the following three categories:
zh_cn: 一般地，快捷键被分为如下三类：

source: In general, the workspace is simply an area where you can organise the different resources of your game while you are working:
zh_cn: 一般情况下，工作区只是一个组织不同资源的区域，你在制作游戏的时候工作区如下图所示:

source: In general, you can set the colour, font, size and style for each of the different options.
zh_cn: 一般来说，您可以为每个不同的选项设置颜色、字体、大小和样式。

source: In most cases you can simply use the os_is_paused function to test this, but in some very specific cases (for example games on Chrome Apps) that function will not trigger, in which case you should use this function instead.
zh_cn: 大多数情况，简单的使用 os_is_paused 测试焦点是否存在，但是一些特殊的情况（比如Chrome Apps 游戏）那个函数不会触发，这时使用本节所说的这个函数替之。

source: In most games you will want certain things to happen at certain moments in time.
zh_cn: 在大部分游戏中，你可能希望一些事情在特定的时间里发生。

source: In order to use this functionality, you will need to have the Amazon API Extension installed.\nWould you like to download it now from the Marketplace?
zh_cn: 为使用这个功能，你将需要安装 Amazon API 扩展。\n现在你想从市场上下载它吗？

source: In order to use this functionality, you will need to have the Facebook Extension installed.\nWould you like to download it now from the Marketplace?
zh_cn: 为使用这个功能，你需要安装 Facebook 的扩展。\n现在你想从市场下载它吗？

source: In order to use this functionality, you will need to have the Google Play APK Expansion Extension installed.\nWould you like to download it now from the Marketplace?
zh_cn: 为使用这个功能，你将需要安装 Google Play APK 扩展。\n现在你想从市场上下载它吗？

source: In order to use this functionality, you will need to have the Google Play Licensing Expansion Extension installed.\nWould you like to download it now from the Marketplace?
zh_cn: 为使用这个功能，你将需要安装 Google Play Licensing 扩展。\n现在你想从市场上下载它吗？

source: In order to use this functionality, you will need to have the Google Play Services Extension installed.\nWould you like to download it now from the Marketplace?
zh_cn: 为使用这个功能，你将需要安装 Google Play Services 扩展。\n现在你想从市场上下载它吗？

source: In order to use this functionality, you will need to have the Google Play Services Extension installed.\nWould you like to download it now?
zh_cn: 为使用该功能你需要安装Google Play服务扩展。\n你想马上通过市场下载吗？

source: In physics, restitution is defined as "the return of an object or system to its original state after elastic deformation", but as the fixtures in the GameMaker Studio 2 are really rigid bodies and cannot be deformed, restitution is really a way of saying how "bouncy" the fixture is.
zh_cn: 在物理学中，恢复原则被定义为“弹性变形后物体或系统返回到原始状态”，但是由于 GameMaker Studio 2 中的灯具真的是刚体，不能变形，恢复系数真的是一种说“弹性”的“弹性”的方式。

source: In previous sections we have covered variables and their scoping rules but little has been said about the different data types that a variable can store.
zh_cn: 在上一部分中，我们讲到了变量以及它们的作用域规则，但是对于变量所能存储的各种数据类型（Data types）所谈甚少。

source: In the GameMaker Studio 2 2D physics world, mass is calculated automatically for you from the values you input for the density and by the surface area of the shape you define for the fixture.
zh_cn: 在 GameMaker Studio 2 2D物理世界中，质量是根据您为密度输入的值和您为夹具定义的形状的表面积自动计算的。

source: In the actual GameMaker Studio 2 object you would see something like this:
zh_cn: 在实际的 GameMaker Studio 2 对象中，您会看到如下所示的内容：

source: In the centre we have the drawing canvas - this shows the currently selected frame ready for drawing and you can use the middle mouse button to pan around and the mouse wheel to zoom in and out
zh_cn: 中央部分是绘图画布 - 这里显示了当前选定的帧并准备好绘画，你可以使用 鼠标中键 来平移或用 鼠标滚轮 放大和缩小

source: In the code you are using an assignment operator wrong (for more information on assignments see here)
zh_cn: 在代码中，你使用的赋值运算符错误（有关赋值的更多信息，请参阅 这里）

source: In the course of things you'll get to use the image editor, the object editor, the code editor and the room editor, which are really where you'll be spending most of your time on any project you create.
zh_cn: 在这个过程中，你需要使用图像编辑器、物体编辑器、代码编辑器和房间编辑器，事实上你创建任何项目都将花费大部分时间在这几个编辑器上。

source: In the following example, we create an enum for the colours of the rainbow and assign it various constants and default values:
zh_cn: 在下述范例中，我们为彩虹的颜色创建一个枚举，并为其赋予不同的变量以及默认值：

source: In the image above we have assigned bookmarks numbered 1, 2, and 4 to different parts of the IDE, and we can now navigate away from these windows or even close them altogether, as the bookmark will permit us to go straight back to it again at any time later.
zh_cn: 在上面的图像中，我们已经将编号为 1,2 和 4 的书签分配给 IDE 的不同部分，现在我们可以离开这些窗口，甚至完全关闭它们，因为书签允许我们直接回到所标示的部分。

source: In the image above, the top part shows the function in the auto-complete and the bottom part shows how the argument helper at the bottom works.
zh_cn: 在上图中，上方部分展示了函数的补全提示，而底部则展现了参数提示器在底部信息栏中如何运作。

source: In the normal draw events, GameMaker Studio 2 doesn't actually draw directly to the screen, but rather draws to a surface called the application surface.
zh_cn: 在一般的绘制事件里， GameMaker Studio 2 不会真实的绘制屏幕上，而是绘制到 表面上，那个表面叫做应用表面。

source: In the script above, the value for argument0 is what will be used to determine the number of times the repeat loop will run, and you would call the script like this:
zh_cn: 在上面的脚本中，argument0的值会被用于决定重复型循环（repeat）的运行次数，并且你可以像这样调用（Call）脚本：

source: In the sections dedicated to variables you found out how to create and create and use variables within a single instance, or on a global scope, but what happens if you want to one instance to access a variable in another, different one?
zh_cn: 在专属于 变量的这一节，你会发现怎样创建，以及在单个实例中创建和使用变量，或者全局变量，但是如果你想在一个实例中访问另外一个不同的实例的变量会怎么样？

source: In these cases you can click the Collision Mask button and select another sprite resource, so now instances of the object will draw the assigned sprite, but base collisions off of the mask sprite.
zh_cn: 在这些情况下，您可以单击“碰撞掩码”按钮并选择另一个精灵资源，因此现在物体的实例将绘制</ i1>指定的精灵，但是从掩码</ i2>精灵之间的基础碰撞。

source: In these cases, and as a compliment to the profiler, you can display the debug bar in your game, which will display much memory, CPU power and GPU power your game is using.
zh_cn: 在这些情况下，作为分析器的补充，您可以在游戏中显示 调试状态条，这将显示游戏正在使用的内存量，CPU 功率和 GPU 功率。

source: In this case the expression will be evaluated, and if the (rounded) value is < = 0 (false) the statement after else is executed, otherwise (true) the other statement is executed.
zh_cn: 在这个情况下，对这个表达式（expression）进行求值，并且如果（近似）值是<=0（false），语句后面的else被执行，否则（true）另一个语句被执行。

source: In this case you can see that almost all events should have the same actions except for one or two that govern movement.
zh_cn: 在这种情况下，您可以看到几乎所有事件应该具有相同的操作，除了一个或两个运动的运动。

source: In this example we will send a local push notification using the following code:
zh_cn: 在这个示例中,我们将使用下面的代码来发送一个本地推送通知:

source: In this quick start guide, we'll look at a tile set for making walls in a top down game.
zh_cn: 在这个快速入门指南中，我们将看到一个用于在上帝视角游戏中制作墙面的图块。

source: In this section of our Quick Start Guide, we'll take you through the process of creating sprites, objects and rooms, getting you to the point where you can compile the project and see the results.
zh_cn: 在快速入门指南的这个部分，我们将带领你完成创建精灵、对线和房间的过程，你可以编译项目并查看结果。

source: In this section we cover the IDE specific areas of the preferences window - for the individual target platforms please see the section on Target Platform Preferences.
zh_cn: 在这一部分，我们将会讨论偏好设置窗口中IDE的具体部分——对于单独平台请参阅章节目标平台（Target Platform）偏好设置

source: In this section you can find additional information relating to how GameMaker Studio 2 works, including things like how the file system works, or a brief overview of bitwise operators.
zh_cn: 本节你可以找到有关 GameMaker Studio 2 是如何工作的详细信息，包括诸如文件系统是如何工作的，或者位运算的简要概述等。

source: In this way you can create a personalised IDE experience that fits your workflow and way of doing things.
zh_cn: 通过这种方式，您可以创建一个适合您工作流程和做事方式的个性化 IDE 体验。

source: In this way you can set up a view of the resource tree that suits your needs.
zh_cn: 以这种方式，您可以设置适合您需要的资源树视图。

source: In this window you can now add the code or actions that you wish to be performed each time that event is triggered within the game loop.
zh_cn: 在这个窗口中，您可以添加您希望在游戏循环内每次触发事件时执行的代码或操作。

source: In your switch statement you have defined default: more than once (for more information on switch see here)
zh_cn: 在 switch 语句中，你多次定义了 default:（有关 switch 的更多信息，请参阅 这里）

source: In your switch you are checking for two different constant case types, for example a string in one case and an integer in another (for more information on switch see here)
zh_cn: 在你的 switch 语句中，您正在检查两种不同的常量 case 类型，例如一种情况下是字符串，另一种情况下是整数（有关 switch 的更多信息，请参阅 这里）

source: Include Font in Build
zh_cn: 包含到构建版本中

source: Include Font in Marketplace Asset
zh_cn: 将字体包含到市场资源中

source: Included File has invalid name
zh_cn: 项目包含文件有无效名称

source: Included File: {0}
zh_cn: 内含文件：{0}

source: Included Files
zh_cn: 内含文件

source: Included Files Label Colour
zh_cn: 内含文件（Included Files）标签颜色

source: Included Files background colour
zh_cn: 内含文件（Included Files）背景颜色

source: Included Files icon colour
zh_cn: 内含文件（Included Files）图标颜色

# Included file '{0}' already exists. Operation cancelled.
source: Included file '{0}' already exists.\nOperation cancelled.
zh_cn: 项目内含文件（Included file） '{0}' 已经存在。\n操作被取消。

source: Included file as index.html
zh_cn: 内含文件（Included file ）作为 index.html

source: Included file with invalid filename: '{0}'
zh_cn: 项目内含文件（Included file）使用了无效的文件名： '{0}'

source: Included files are, as the name suggests, any file that you wish to be included with the game bundle when you export the game to the target platform.
zh_cn: 顾名思义，包含文件是在您将游戏导出到目标平台时，希望包含在游戏包中的所有文件。

source: Incompatible Resource
zh_cn: 不兼容资源

source: Increase
zh_cn: 增量

source: Increase brush size
zh_cn: 增大画刷尺寸

source: Increase current brush size
zh_cn: 增大当前画刷大小

source: Increase playback speed
zh_cn: 加快播放速度

source: Increase size of current brush with smoothing (interpolation)
zh_cn: 增大当前带有平滑（插值）的画刷大小

source: Increase the font size in any of the code editors
zh_cn: 增大所有代码编辑器的字体大小

source: Increment
zh_cn: 增量

source: Increment/Decrement (++, --)
zh_cn: 递增/递减 (++, --)

source: Increment:
zh_cn: 增量：

source: Index
zh_cn: 索引

source: Index Alignment
zh_cn: 指数对齐

source: Index of the font to check.
zh_cn: 待检测的字体索引。

source: Individual package name parts may only start with a letter and cannot be a reserved Java keyword
zh_cn: 单个程序包名称部分只能以字母开头，不能是保留的Java关键字

source: Information
zh_cn: 信息

source: Inherit
zh_cn: 继承

source: Inherit Assets
zh_cn: 继承资产

source: Inherit Background Properties
zh_cn: 继承背景属性

source: Inherit Creation Code
zh_cn: 继承创建时代码

source: Inherit Creation Order
zh_cn: 继承创建时顺序

source: Inherit Editor Properties
zh_cn: 继续编辑器属性

source: Inherit Editor Settings
zh_cn: 继承编辑器设置

source: Inherit Event
zh_cn: 继承事件

source: Inherit From Project
zh_cn: 继承自项目

source: Inherit Graphic Properties
zh_cn: 继承图像属性

source: Inherit Instance Properties
zh_cn: 继承实例属性

source: Inherit Instances
zh_cn: 继承实例

source: Inherit Layer Depth
zh_cn: 继承层深度

source: Inherit Layer Visibility
zh_cn: 继承图层可见设置

source: Inherit Layers
zh_cn: 继承层

source: Inherit Path Properties
zh_cn: 继承路径属性

source: Inherit Physics Properties
zh_cn: 继承物理属性

source: Inherit Physics Settings
zh_cn: 继承物理设定

source: Inherit Project
zh_cn: 继承项目

source: Inherit Room Settings
zh_cn: 继承房间设置

source: Inherit Sub Layers
zh_cn: 继承子层

source: Inherit Tile Properties
zh_cn: 继承图块属性

source: Inherit View
zh_cn: 继承视野

source: Inherit View Properties
zh_cn: 继承视野属性

source: Inherit View Settings
zh_cn: 继承视野设置

source: Inherited Events Alpha
zh_cn: 继承事件Alpha

source: Inherited tile highlight colour
zh_cn: 继承的图块高亮颜色

source: Inheriting Events
zh_cn: 继承事件

source: Init Function:
zh_cn: 初始函数：

source: Initial X Coordinate
zh_cn: 初始X坐标

source: Initial Y Coordinate
zh_cn: 初始Y坐标

source: Initial default draw colour for new projects
zh_cn: 新项目的初始默认绘制颜色

source: Initialise
zh_cn: 初值

source: Initializing an array just means that we give each position of the array an initial value in preparation for it to be used elsewhere in the object or code.
zh_cn: 初始化数组的意思就是给数组中每一个位置的数据赋予一个初始值，以便我们之后的物体或者代码块中使用。

source: Initially, the device list will be empty and you need to click on the Pencil icon to open the Device Editor:
zh_cn: 最开始设备列表为空，您需要单击 “铅笔”图标 以打开 设备编辑器：

source: Inject to AndroidManifest.xml Application:
zh_cn: 注入到 AndroidManifest.xml 应用：

source: Inject to AndroidManifest.xml Manifest:
zh_cn: 注入到 AndroidManifest.xml 表单：

source: Inject to AndroidManifest.xml RunnerActivity:
zh_cn: 注入到 AndroidManifest.xml RunnerActivity:

source: Inject to Gradle dependancies:
zh_cn: 注入 Gradle 关联：

source: Inject to Gradle dependencies:
zh_cn: 注入到 Gradle 依赖项：

source: Inject to Info.plist:
zh_cn: 注入到 Info.plist：

source: Input
zh_cn: 输入

source: Insert
zh_cn: 插入

source: Insert or SHIFT + A
zh_cn: Insert 或 SHIFT + A

source: Insert Column After
zh_cn: 向后插入列

source: Insert Column Before
zh_cn: 向前插入列

source: Insert Frame
zh_cn: 插入帧

source: Insert Grid Column Dock Splitter After
zh_cn: 向后插入网格列停靠栏拆分器

source: Insert Grid Column Dock Splitter Before
zh_cn: 向前插入网格列的停靠栏拆分器

source: Insert Grid Column Splitter After
zh_cn: 向后插入网格列拆分器

source: Insert Grid Column Splitter Before
zh_cn: 向前插入网格列拆分器

source: Insert Grid Row Dock Splitter After
zh_cn: 向后插入网格行停靠栏的拆分器

source: Insert Grid Row Dock Splitter Before
zh_cn: 向前插入网格行停靠栏的拆分器

source: Insert Grid Row Splitter After
zh_cn: 向后插入网格行拆分器

source: Insert Grid Row Splitter Before
zh_cn: 向前插入网格行拆分器

source: Insert Included File
zh_cn: 插入内含文件

source: Insert Into List
zh_cn: 插入到列表

source: Insert Row After
zh_cn: 插入行后

source: Insert Row Before
zh_cn: 插入行前

source: Insert an item into a list at an index.
zh_cn: 在指定索引位置插入一项。

source: Insert path point precision (px)
zh_cn: 插入路径点精度 (px)

source: Inserting {0} at this location would result in an invalid program.
zh_cn: 在这个位置插入 {0} 将会导致程序无效。

source: Install
zh_cn: 安装

source: Install ${APP_NAME}.
zh_cn: 安装 ${APP_NAME}.

source: Install Failed
zh_cn: 安装失败

source: Install Folder:
zh_cn: 安装文件夹：

source: Install Location
zh_cn: 安装位置

source: Install Microsoft Dot NET 3.5sp1 and 4.5 Frameworks.
zh_cn: 安装 Microsoft Dot NET 3.5sp1 和 4.5 Frameworks。

source: Install Microsoft Visual Studio 2012 and 2015 C++ x64 runtimes.
zh_cn: 安装 Microsoft Visual Studio 2012 和 2015 C++ x64 运行库。

source: Install Patch
zh_cn: 安装补丁包

source: Install Tutorials
zh_cn: 安装教程

source: Install location
zh_cn: 安装位置

source: Install on Package
zh_cn: 安装APK程序包

source: Install on any supported Android Device
zh_cn: 在所支持的任意一个Android设备上安装

source: Install on any supported Android device
zh_cn: 在任何支持的Android设备上安装

source: Install on package
zh_cn: 在程序包上安装

source: Installed
zh_cn: 已安装

source: Installer
zh_cn: 安装程序

source: Installer Finished Image
zh_cn: 安装程序完成后图像

source: Installer Header Image
zh_cn: 安装程序顶部图片

source: Installer NSI Script
zh_cn: 安装程序 NSI 脚本

source: Installing
zh_cn: 安装

source: Installing Tutorial
zh_cn: 安装教程

source: Installing a Runtime
zh_cn: 安装一个运行环境

source: Installing runtime {0}
zh_cn: 正在安装运行库 {0}

source: Installing...
zh_cn: 安装中...

source: Installing:{0}
zh_cn: 安装：{0}

source: Instance
zh_cn: 实例

source: Instance Code in Room: {0}
zh_cn: 房间中的实例代码：{0}

source: Instance Creation Order
zh_cn: 实例创建顺序

source: Instance Creation Order - {0}
zh_cn: 实例创建顺序 - {0}

source: Instance Layer
zh_cn: 实例层

source: Instance Variables
zh_cn: 实例变量

source: Instance: {0}
zh_cn: 实例：{0}

source: Instances
zh_cn: 实例

source: Instances of this object will persist between rooms
zh_cn: 这个物体的实例将在不同房间中一直保持存在

source: Instances use physics processing when in a room with 'Enable Physics' checked
zh_cn: 在选中“启用物理”的房间中，实例使用物理处理

source: Instead we are going to create a couple of tiny "batch" files to handle this.
zh_cn: 取代方案是，我们将创建几个小的“批处理”文件来解决这个问题。

source: Instead, you must reset the target for each of the surfaces that you set, much like you must use opening and closing brackets {} for code blocks.
zh_cn: 换之，你必须为每一个设置的表面重置目标，就像你必须在代码中使用打开和关闭的大括号{} 。

source: Integer
zh_cn: 整数

source: Integer divides as shown above really help optimising your game.
zh_cn: 使用上述的整数触发确实会有效地优化你的游戏。

source: Intensity:
zh_cn: 强度：

source: Interface
zh_cn: 界面

source: Interpolate
zh_cn: 插值

source: Interpolate colours between pixels
zh_cn: 对像素间颜色进行插值

source: Interpolation:
zh_cn: 插值：

source: Intersect Boundary
zh_cn: 相交边界

source: Intersect View {0} Boundary
zh_cn: 接触视野 {0} 边界

source: Invalid
zh_cn: 无效

source: Invalid File Format
zh_cn: 文件格式无效

source: Invalid Insertion
zh_cn: 无效插入

source: Invalid Name, already in use: {0}.
zh_cn: 无效的名称，已经在使用： {0。.

source: Invalid Name, cannot change extension from '{0}' to '{1}'.
zh_cn: 无效的名称，不能更改扩展名 '{0}' 为 '{1}'。

source: Invalid Name, contains invalid characters: {0}.
zh_cn: 无效的名称，包含了无效的字符： {0}。

source: Invalid Name, reserved keyword: {0}.
zh_cn: 无效的名称，使用了保留关键字： {0}。

source: Invalid Parent
zh_cn: 无效的父级

source: Invalid Path
zh_cn: 路径无效

source: Invalid Project
zh_cn: 项目无效

source: Invalid action name: must be XML compatible.
zh_cn: 无效的动作名称：必须与XML兼容。

source: Invalid anchor point colour
zh_cn: 锚点颜色无效

source: Invalid characters in alias
zh_cn: 别名中的字符无效

source: Invalid characters in alias password
zh_cn: 别名密码中的字符无效

source: Invalid characters in common name
zh_cn: 通用名中字符无效

source: Invalid characters in country
zh_cn: 国家中字符无效

source: Invalid characters in location
zh_cn: 位置中字符无效

source: Invalid characters in organisation
zh_cn: 组织中字符无效

source: Invalid characters in organisational unit
zh_cn: 组织单位中字符无效

source: Invalid characters in password
zh_cn: 密码中的字符无效

source: Invalid input.
zh_cn: 无效的输入。

source: Invalid model.
zh_cn: 模型无效

source: Invalid name, already in use: {0}.
zh_cn: 名称无效，已在使用中：{0}。

source: Invalid name, cannot change extension from '{0}' to '{1}'.
zh_cn: 名称无效，无法将扩展名从'{0}'更改为'{1}'。

source: Invalid name, contains invalid characters: {0}.
zh_cn: 名称无效，包含无效字符：{0}.

source: Invalid name, reserved keyword: {0}.
zh_cn: 名称无效，保留关键字：{0}.

source: Invalid path colour
zh_cn: 路径颜色无效

source: Invalid session (User)
zh_cn: 会话无效（用户）

source: Inverse Gaussian
zh_cn: 逆高斯

source: Invert Selection
zh_cn: 反选

source: Invert selection
zh_cn: 反选

source: Invisible objects will still react to events and if they have a sprite or a mask assigned to them, they will also react should other instances collide with them... they just cannot be seen and do not perform their draw event.
zh_cn: 不可见的物体仍然会对事件作出反应，如果他们有精灵或者遮罩也会发生碰撞事件，他们只不过是不可见并且不会执行绘制事件。 draw event.

source: Is
zh_cn: 是

source: Is Android NDK Valid
zh_cn: Android NDK 是否有效

source: Is Android SDK Valid
zh_cn: Android SDK 是否有效

source: Is Game
zh_cn: 是游戏

source: Is Installed
zh_cn: 已安装

source: Is Relative
zh_cn: 是相对的

source: Is Temp
zh_cn: 是临时的

source: Is game
zh_cn: 是游戏

source: It also happens when you use the with() statement in code (see the manual for further details), and it works when you call code functions like instance_position, instance_number, etc... where if you supply a parent object then it and all child instances will be included in the checks.
zh_cn: 当您在代码中使用 with（）语句时也会发生这种情况（有关更多详细信息，请参阅手册），当您调用代码函数（如<a​​1> instance_position ， instance_number ，etc ...如果您提供一个父对象，那么它将会被包含在检查中。

source: It always exists, although the index value to access it may change.
zh_cn: 它一直会存在，尽管访问它的索引值可能会改变。

source: It can also be useful for clearing surfaces when they are newly created.
zh_cn: 当新建表面时，它也可用于填充 表面 。

source: It can be a string, number or variable.
zh_cn: 可以是字符串，数字或者变量。

source: It can be moved and positioned within the room, and you can have multiple background layers.
zh_cn: 它可以在房间内移动和定位，并且一个房间可以有多个背景层。

source: It can be used for HTML5 too, but will only return a value relative to the 0,0 of the canvas itself, and will not return any value while the mouse is outside of the canvas.
zh_cn: 当然HTML5也可以一用，但只是返回相对于画布(0,0)的一个值，鼠标在画布外面时不会返回任何值。

source: It can therefore be of vital importance to know how your game is performing on the chosen device, as well as see what instances are in the room, what global variables have been created and a whole host of other details.
zh_cn: 因此，及时了解您的游戏在所选设备上的表现，以及房间中的实例，所创建的全局变量以及其他详细信息，是至关重要的。

source: It consists of dragging and dropping actions into the Object Editor to create a list of functions that instances of the object will follow.
zh_cn: 由拖拽动作组成拖放到物体编辑器中，创建一系列的物体实例将遵循的函数列表。

source: It contains the following menu items:
zh_cn: 包含如下菜单项：

source: It has this form:
zh_cn: 结构如下：

source: It is a good habit to always put curly brackets around the statements in the if", and take a new line in the block for each statement, so the end code will have this form:
zh_cn: 经常在if后面的语句放上花括号是一个好习惯，并且为每一个语句另起一行，所以最终代码将会有这种格式：

source: It is also a good idea to clean the cache before you create a final executable for the target platform.
zh_cn: 在为目标平台创建最终的可执行文件前最好也清理一下缓存。

source: It is also worth noting that the length of each 2D array can be different, so you can have an array with a height of 2, but entry 0 could be 2 in length, entry 1 could be 4 in length and entry 2 could be 3 in length:
zh_cn: 同样值得注意的是，每一个二维数组的长度可以是不同的，所以你可以有一个数组的高度是2，但入口0的长度是2、入口1的长度是4，并且入口2的长度是3：

source: It is also worth noting that you can find third party tutorials and demos from the Marketplace too, and once these have been purchased and added to your account they will also appear in the "Owned" section of the appropriate page.
zh_cn: 还值得一提的是，你可以从市场找到第三方的教程和演示项目，一旦购买它们并添加到您的帐户，它们也将出现相应的页面的“已拥有”部分。

source: It is also worth noting that you can use the accessor @ to reference an array from a script and change its values directly, which saves the CPU overhead of having it copied into the script.
zh_cn: 值得注意的是，你可以使用访问器 @ 在脚本中引用并直接更改数组的值，这样可以节省将数组复制到脚本中的CPU开销。

source: It is generally considered good practice in most cases to create one base parent object and have this base object contain all the default behaviour but never use an instance of it in the game.
zh_cn: 在大多数情况下，通常认为创建一个基本父对象的良好做法，并且该基础对象包含所有默认行为，但不要在游戏中使用它的一个实例。

source: It is highly recommended that all surfaces be created with a size that is a power of 2, ie: 16, 128, 512 or 1024 pixels in size, for example.
zh_cn: 强烈建议所有创建的表面图层大小设置为2的N次方，比如16、128、512、1024像素。

source: It is intended primarily as a tool for making 2D games - although 3D games are perfectly doable - and comes with a number of tools and editors to help you realise your dreams and ideas, with your final project being ported across multiple platforms from the same initial base resources.
zh_cn: 它主要是用来制作2D游戏的工具，虽然制作3D游戏也是可行的。有许多工具和编辑器能帮助实现你的游戏想法，将您的最终项目从同样的初始基础资源移植到多个平台上。

source: It is off by default (and this is the recommended setting).
zh_cn: 该选项默认为关（并且推荐为关）

source: It is often overlooked when adding behaviours to objects, but it can be very useful - for example, for creating explosion or particle effects when an enemy is killed, or for re-spawning a new instance of the object in another part of the room, or even for adding points onto a score.
zh_cn: 在向物体添加行为时往往会被忽略，但它可能非常有用 - 例如，在敌人死亡时创建爆炸或粒子效果，或者在房间的另一部分重新产生物体的新实例， 以及用于添加分数。

source: It is on by default, but even if it is switched off you can enable it again using the appropriate button in the room editor itself.
zh_cn: 默认情况下，它是打开的，但即使它是关闭的，你仍然可以使用房间编辑器适当的按钮再次启用它。

source: It is on by default.
zh_cn: 此选项默认打开。

source: It is worth noting that placing this before or after the value to be added to or subtracted from will have slightly different results.
zh_cn: 值得注意的是在值之前或之后使用这个运算符结果稍微有些不同。
